In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/56/dd/9676967eac629273b2da40c53845f28d58af1800940d9b4067fc9a735dfb/pandas-1.3.4-cp38-cp38-macosx_10_9_x86_64.whl (11.4MB)
    100% |████████████████████████████████| 11.4MB 2.8MB/s ta 0:00:011
Collecting pytz>=2017.3 (from pandas)
  Using cached https://files.pythonhosted.org/packages/d3/e3/d9f046b5d1c94a3aeab15f1f867aa414f8ee9d196fae6865f1d6a0ee1a0b/pytz-2021.3-py2.py3-none-any.whl
Collecting numpy>=1.17.3; platform_machine != "aarch64" and platform_machine != "arm64" and python_version < "3.10" (from pandas)
  Downloading https://files.pythonhosted.org/packages/62/25/f7caa74a9853b9275ebb58b4a2b82608022cf43c92d540412204732ec39e/numpy-1.21.3-cp38-cp38-macosx_10_9_x86_64.whl (16.9MB)
    100% |████████████████████████████████| 16.9MB 2.2MB/s ta 0:00:011
Requirement already satisfied: python-dateutil>=2.7.3 in ./venv/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.21.3 pandas-1.3.4 pytz-2021.3

In [2]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Allen', '22', '175']
df

    Name Age Height
0  Allen  22    175

In [4]:
df.loc[1] = ['Ted', '25', '180']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [5]:
df['Name']

0    Allen
1      Ted
Name: Name, dtype: object

In [6]:
df['Weight'] = ['75', '80']
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80

In [10]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [11]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80

In [12]:
df = df.drop(['Weight'], axis=1)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [13]:
df.drop(1)

    Name Age Height
0  Allen  22    175

In [14]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [15]:
df = df.drop(1)

In [16]:
df

    Name Age Height
0  Allen  22    175

In [17]:
df.loc[1] = ['Ted', '25', '180']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [18]:
df['Height'] = '188'
df

    Name Age Height
0  Allen  22    188
1    Ted  25    188

In [19]:
df.loc[1] = 'aaa'
df

    Name  Age Height
0  Allen   22    188
1    aaa  aaa    aaa

In [20]:
df['Height'][1] = '170'
df

    Name  Age Height
0  Allen   22    188
1    aaa  aaa    170

In [22]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Allen', '22', '175'],
    ['Ted', '25', '180']
]

df = pd.DataFrame(data=data, columns=columns)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [23]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [24]:
df2 = df

In [25]:
df2

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [26]:
df2["Name"] = "asdsadsadas"
df2

          Name Age Height
0  asdsadsadas  22    175
1  asdsadsadas  25    180

In [27]:
df

          Name Age Height
0  asdsadsadas  22    175
1  asdsadsadas  25    180